glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32625.pdsc
   <boards>
      <board vendor="Maxim" name="MAX32625_EVKIT" revision="REV 3.0" salesContact="sales@maximintegrated.com" orderForm="http://www.maximintegrated.com/MAX32625">
         <description>The MAX32625 Evaluation Kit provides a convenient platform for evaluating the capabilities of the MAX32625 Family of microcontrollers. The Evaluation Kit also provides a complete, functional system ideal for developing and debugging applications. This Evaluation Kit supports the MAX32625.
         </description>
         <image small="http://www.mxim.net/microcontroller/pack/images/MAX32625_EvKit_Large.jpg" large="http://www.mxim.net/microcontroller/pack/images/MAX32625_EvKit_Large.jpg"/>
         <book category="manual" name="https://datasheets.maximintegrated.com/en/ds/MAX32625-EVKIT.pdf" title="Evaluation Kit Datasheet and Configuration"/>
         <book category="schematic" name="https://datasheets.maximintegrated.com/en/ds/MAX32625-EVKIT.pdf" title="Schematic"/>
         <mountedDevice Dvendor="Maxim:23" Dname="MAX32625"/>
         <compatibleDevice Dvendor="Maxim:23" Dfamily="MAX32625"/>
         <feature type="PWR" n="3.3" m="5.5"/>
         <feature type="Proto" n="13" m="11" name="13 x 11 Prototyping Area with one row connected to 1.8V PWR, one row connected to 3.3V PWR and one row connected to GND"/>
         <feature type="Memory" n="16" name="MB SPI Flash"/>
         <feature type="DIO" n="49" name="General Purpose IO on 3 x 16 pin headers, JH1-JH3, and 1 pin on JH4"/>
         <feature type="AIO" n="4" name="Analog Inputs on 4 x 2 pin headers"/>
         <feature type="SPI" n="4" name="3 x SPI Master and 1 x SPI Slave ports mapped on GPIO"/>
         <feature type="I2C" n="3" name="Up to 3 x I2C Master Ports,  1 x I2C Slave (shares same I/O as each of the master ports)"/>
         <feature type="RS232" n="4" name="1 UART, either UART0 or UART1, can be connected to the USB Micro B connector (CN1) via jumpers (JP10, JP12, JP13 and JP14). RTS/CTS hardware flow control are supported via USB as well. The remaining 3 UARTS are mapped to GPIO headers."/>
         <feature type="LED" n="4" name="User LEDs"/>
         <feature type="Other" n="1" name="External Bluetooth 4.0 Low Energy transceiver with chip antenna"/>
         <feature type="GLCD" n="1" m="128.32" name="pixel graphic OLED display module. User connectable to SPI0 via jumpers"/>
         <feature type="XTAL" n="96000000"/>
         <debugInterface adapter="JTAG/SW" connector="20-pin ARM Standard JTAG Connector (0.1 inch connector)"/>
      </board>
   </boards>

   <examples>
      <example name="ADC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32625_EVKIT/ADC">
         <description>ADC Conversion Demo</description>
         <board name="MAX32625_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/ADC.uvprojx"/>
            <environment name="iar" load="IAR/ADC.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32625 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="5.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="ADC" Cvendor="Maxim"/>
            <component Cclass="Peripherals" Cgroup="Timers" Cvendor="Maxim"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>ADC</keyword>
            <keyword>Analog</keyword>
         </attributes>
      </example>

      <example name="AES" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32625_EVKIT/AES">
         <description>Advanced Encryption Standard (AES) Demo</description>
         <board name="MAX32625_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/AES.uvprojx"/>
            <environment name="iar" load="IAR/AES.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32625 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="5.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="AES" Cvendor="Maxim"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>

            <keyword>Getting Started</keyword>
            <keyword>AES</keyword>
         </attributes>
      </example>

      <example name="CLKMAN_4MHz" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32625_EVKIT/CLKMAN_4MHz">
         <description>Clock management and usage of the 4MHz internal clock demo application</description>
         <board name="MAX32625_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/CLKMAN_4MHz.uvprojx"/>
            <environment name="iar" load="IAR/CLKMAN_4MHz.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32625 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="5.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="Timers"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>

            <keyword>Getting Started</keyword>
            <keyword>Clocks</keyword>
         </attributes>
      </example>

      <example name="CRC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32625_EVKIT/CRC">
         <description>Cyclic Redundancy Check Example Application</description>
         <board name="MAX32625_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/CRC.uvprojx"/>
            <environment name="iar" load="IAR/CRC.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32625 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="5.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="CRC" Cvendor="Maxim"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>

            <keyword>Getting Started</keyword>
            <keyword>AES</keyword>
         </attributes>
      </example>

      <example name="EVK_Demo" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32625_EVKIT/EVK_Demo">
         <description>MAX32625 Evaluation Kit Default Demo Application</description>
         <board name="MAX32625_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/EVK_Demo.uvprojx"/>
            <environment name="iar" load="IAR/EVK_Demo.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32625 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="5.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="Timers"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Timers</keyword>
         </attributes>
      </example>

      <example name="Hello_World" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32625_EVKIT/Hello_World">
         <description>Hello World Demo</description>
         <board name="MAX32625_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/Hello_World.uvprojx"/>
            <environment name="iar" load="IAR/Hello_World.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32625 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="5.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="Timers"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

