glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32625.pdsc
      <example name="RTX_Blinky" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32625_EVKIT/RTX_Blinky">
         <description>CMSIS-RTOS Blinky</description>
         <board name="MAX32625_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/RTX_Blinky.uvprojx"/>
            <environment name="iar" load="IAR/RTX_Blinky.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32625 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="RTOS"/>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="5.3.0"/>
            <component Cbundle="ARM Compiler" Cclass="Compiler" Cgroup="Event Recorder" Cvariant="DAP"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>CMSIS-RTX</keyword>
            <keyword>RTOS</keyword>
         </attributes>
      </example>

      <example name="SPIM_MX25" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32625_EVKIT/SPIM_MX25">
         <description>SPI Master Example showing use of the on-board MX25 Flash for Storage</description>
         <board name="MAX32625_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/SPIM_MX25.uvprojx"/>
            <environment name="iar" load="IAR/SPIM_MX25.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32625 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="5.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>External Memory</keyword>
            <keyword>SPI Master</keyword>
         </attributes>
      </example>

      <example name="SPIS" doc="IAR/Abstract.txt" folder="Boards/Maxim/MAX32625_EVKIT/SPIS">
         <description>SPI Slave Example showing use of the SPI Slave loopback from the SPI Master</description>
         <board name="MAX32625_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/SPIS.ewp"/>
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32625 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="5.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="Timers"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="SPI Slave"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>External Memory</keyword>
            <keyword>SPI XiP</keyword>
         </attributes>
      </example>

      <example name="SPIX_MX25" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32625_EVKIT/SPIX_MX25">
         <description>SPI XIP Example showing use of the on-board MX25 Flash for Execution</description>
         <board name="MAX32625_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/SPIX_MX25.uvprojx"/>
            <environment name="iar" load="IAR/SPIX_MX25.ewp"/>
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32625 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="5.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="SPI XIP"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>External Memory</keyword>
            <keyword>SPI XiP</keyword>
         </attributes>
      </example>

      <example name="SysTick" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32625_EVKIT/SysTick">
         <description>System Tick LED Demo</description>
         <board name="MAX32625_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/SysTick.uvprojx"/>
            <environment name="iar" load="IAR/SysTick.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32625 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="5.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

