glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32625.pdsc
      <example name="Watchdog" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32625_EVKIT/Watchdog">
         <description>Watchdog Timer Demo</description>
         <board name="MAX32625_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/Watchdog.uvprojx"/>
            <environment name="iar" load="IAR/Watchdog.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32625 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="5.3.0" />
            <component Cclass="Device" Cgroup="Startup" />
            <component Cclass="HAL" Cgroup="Hardware Access Layer" />
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="WDT" Csub="WDT1" />
            <component Cclass="Communications" Cgroup="SPI Master" />
            <component Cclass="Communications" Cgroup="I2C Master" />
            <component Cclass="Communications" Cgroup="UART" />
            <component Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support" />
            <keyword>Getting Started</keyword>
            <keyword>Watchdog</keyword>
         </attributes>
      </example>
   </examples>

   <conditions>
      <condition id="MAX32625 Device">
         <description> Maxim Integrated MAX32625 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32625"/>
      </condition>

      <condition id="MAX32626 Device">
         <description> Maxim Integrated MAX32625 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32626"/>
      </condition>

      <condition id="MAX32625 CMSIS-CORE">
         <description>Maxim MAX32625 Series devices and CMSIS-CORE</description>
         <accept Cgroup="CORE" Cclass="CMSIS" Cversion="4.1.0"/>
         <accept condition="MAX32625 Device"/>
         <accept condition="MAX32626 Device"/>
         <require Cclass="Device" Cgroup="Startup"/>
      </condition>

      <condition id="Startup ARM">
         <description>Startup files for the Keil/ARMCC Toolchains</description>
         <require Tcompiler="ARMCC"/>
      </condition>

      <condition id="Startup GCC">
         <description>Startup files for the GNU C Toolchain</description>
         <require Tcompiler="GCC"/>
      </condition>

      <condition id="Startup IAR">
         <description>Startup files for the IAR Embedded Workbench Toolchain</description>
         <require Tcompiler="IAR"/>
      </condition>

      <condition id="MAX32625 CMSIS ADC">
         <description>ADC Interface</description>
         <require Dvendor="Maxim:23"/>
         <require condition="MAX32625 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32625 CMSIS AES">
         <description>Advanced Encryption Standard</description>
         <require condition="MAX32625 CMSIS-CORE"/>
      </condition>

      <condition id="MAX32625 CMSIS CRC">
         <description>Advanced Encryption Standard</description>
         <require condition="MAX32625 CMSIS-CORE"/>
      </condition>

      <condition id="MAX32625 CMSIS GPIO">
         <description>GPIO Interface Layer</description>
         <require condition="MAX32625 CMSIS-CORE"/>
      </condition>

      <condition id="MAX32625 CMSIS I2C Master">
         <description>I2C Master Interface</description>
         <require condition="MAX32625 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>

      </condition>
      <condition id="MAX32625 CMSIS I2C Slave">
         <description>I2C Slave Interface</description>
         <require condition="MAX32625 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32625 CMSIS 1-Wire">
         <description>1-Wire Master Interface</description>
         <require condition="MAX32625 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32625 CMSIS PMU">
         <description>Peripheral Management Unit for DMA</description>
         <require condition="MAX32625 CMSIS-CORE"/>
      </condition>

      <condition id="MAX32625 CMSIS Pulse Train">
         <description>Pulse Train (PWM) Controller</description>
         <require condition="MAX32625 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32625 CMSIS RTC">
         <description>Real Time Clock</description>
         <require condition="MAX32625 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32625 CMSIS Flash IAP">
         <description>In-Application Flash Programming</description>
         <require condition="MAX32625 CMSIS-CORE"/>
      </condition>

      <condition id="MAX32625 CMSIS SPI Master">
         <description>SPI Master Interface</description>
         <require condition="MAX32625 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32625 CMSIS SPI Slave">
         <description>SPI Slave Interface</description>
         <require condition="MAX32625 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32625 CMSIS SPI XIP">
         <description>SPI eXecute In Place</description>
         <require condition="MAX32625 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32625 CMSIS TIMER">
         <description>32/16-Bit Timers</description>
         <require condition="MAX32625 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32625 CMSIS WDT1">
         <description>Watchdog Timer 1</description>
         <require condition="MAX32625 CMSIS-CORE"/>
      </condition>

      <condition id="MAX32625 CMSIS WDT2">
         <description>Watchdog Timer 2</description>
         <require condition="MAX32625 CMSIS-CORE"/>
      </condition>

      <condition id="MAX32625 CMSIS UART">
         <description>UART</description>
         <require condition="MAX32625 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

