glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32625.pdsc
      <condition id="MAX32625 BSP">
         <description>Board Support Package</description>
         <require condition="MAX32625 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
         <require Cclass="HAL" Cgroup="Hardware Access Layer"/>
         <require Cclass="Communications" Cgroup="SPI Master"/>
         <require Cclass="Communications" Cgroup="I2C Master"/>
         <require Cclass="Communications" Cgroup="UART"/>
      </condition>

      <condition id="Maxim USB">
         <description>MAXUSB Libraries</description>
         <require Dvendor="Maxim:23"/>
         <require condition="MAX32625 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
         <require Cclass="HAL" Cgroup="Hardware Access Layer"/>
      </condition>

   </conditions>

   <components>
      <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0-a" condition="MAX32625 Device">
         <description>System Startup for Maxim MAX32625 Microcontroller</description>
         <RTE_Components_h>
               <!-- the following content goes into file 'RTE_Components.h' -->
               #define TARGET MAX32625   /* Target Device Part Number */
               #define TARGET_REV 0x4132 /* Target Device Revision Number */
               #define TARGET_NUM 32625 /* Just the part target number */
               #define MXC_ASSERT_ENABLE /* Assertion checking for the API */
               #define MXC_ADC_REV 1
               #define CMSIS_VECTAB_VIRTUAL
               #define CMSIS_VECTAB_VIRTUAL_HEADER_FILE "nvic_table.h"
         </RTE_Components_h>
         <files>
            <file category="include" name="Libraries/Device/Maxim/MAX32625/Include/"/>
            <file category="include" name="Libraries/MAX32625PeriphDriver/Include/"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32625/Source/ARM/startup_max32625.s" version="1.1.0-a" condition="Startup ARM"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32625/Source/GCC/startup_max32625.S" version="1.1.0-a" condition="Startup GCC"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32625/Source/IAR/startup_max32625.s" version="1.1.0-a" condition="Startup IAR"/>
            <file category="sourceC" attr="config" name="Libraries/Device/Maxim/MAX32625/Source/IAR/low_level_init.c" version="1.1.0-a" condition="Startup IAR"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32625/Source/IAR/cmain.s" version="1.1.0-a" condition="Startup IAR"/>
            <file category="sourceC" attr="config" name="Libraries/Device/Maxim/MAX32625/Source/system_max32625.c" version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/nvic_table.c" version="1.1.0-a"/>
            <file category="header" attr="config" name="Libraries/Device/Maxim/MAX32625/Include/max32625.h" version="1.1.0-a" />
         </files>
      </component>

      <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0-a" condition="MAX32626 Device">
         <description>System Startup for Maxim MAX32626 Microcontroller</description>
         <RTE_Components_h>
               <!-- the following content goes into file 'RTE_Components.h' -->
               #define TARGET MAX32625   /* Target Device Part Number */
               #define TARGET_REV 0x4132 /* Target Device Revision Number */
               #define TARGET_NUM 32625 /* Just the part target number */
               #define MXC_ASSERT_ENABLE /* Assertion checking for the API */
               #define MXC_ADC_REV 1
               #define CMSIS_VECTAB_VIRTUAL
               #define CMSIS_VECTAB_VIRTUAL_HEADER_FILE "nvic_table.h"
         </RTE_Components_h>
         <files>
            <file category="include" name="Libraries/Device/Maxim/MAX32625/Include/"/>
            <file category="include" name="Libraries/MAX32625PeriphDriver/Include/"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32625/Source/ARM/startup_max32625.s" version="1.1.0-a" condition="Startup ARM"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32625/Source/GCC/startup_max32625.S" version="1.1.0-a" condition="Startup GCC"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32625/Source/IAR/startup_max32625.s" version="1.1.0-a" condition="Startup IAR"/>
            <file category="sourceC" attr="config" name="Libraries/Device/Maxim/MAX32625/Source/IAR/low_level_init.c" version="1.1.0-a" condition="Startup IAR"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32625/Source/IAR/cmain.s" version="1.1.0-a" condition="Startup IAR"/>
            <file category="sourceC" attr="config" name="Libraries/Device/Maxim/MAX32625/Source/system_max32625.c" version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/nvic_table.c" version="1.1.0-a"/>
            <file category="header" attr="config" name="Libraries/Device/Maxim/MAX32625/Include/max32625.h" version="1.1.0-a" />
         </files>
      </component>

      <component Cclass="HAL" Cgroup="Hardware Access Layer" Cversion="1.1.0-a" condition="MAX32625 CMSIS-CORE">
         <description>Hardware Access Layer and System Configuration</description>
         <files>
            <file category="header" attr="config" name="Libraries/Device/Maxim/MAX32625/Include/max32625.h" version="1.1.0-a"/>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/clkman.c" version="1.1.0-a"/>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/flc.c" version="1.1.0-a"/>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/icc.c" version="1.1.0-a"/>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/lp.c" version="1.1.0-a"/>
            <file category="header" attr="config" name="Libraries/MAX32625PeriphDriver/Include/mxc_config.h" />
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/mxc_assert.c" version="1.1.0-a"/>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/mxc_lock.c" version="1.1.0-a"/>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/mxc_sys.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="ADC" Cversion="1.1.0-a" condition="MAX32625 CMSIS ADC">
         <description>ADC Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/adc.c" version="1.1.0-a"/>
         </files>
      </component>

