glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32625.pdsc
      <component Cclass="Trust Protection Unit" Cgroup="AES" Cversion="1.1.0-a" condition="MAX32625 CMSIS AES">
         <description>AES Hardware Engine</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/aes.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="CRC" Cversion="1.1.0-a" condition="MAX32625 CMSIS CRC">
         <description>CRC Engine</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/crc.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="GPIO" Cversion="1.1.0-a" condition="MAX32625 CMSIS GPIO">
         <description>GPIO</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/gpio.c" version="1.1.0-a"/>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/ioman.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Communications" Cgroup="I2C Master" Cversion="1.1.0-a" condition="MAX32625 CMSIS I2C Master">
         <description>I2C Master Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/i2cm.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Communications" Cgroup="I2C Slave" Cversion="1.1.0-a" condition="MAX32625 CMSIS I2C Slave">
         <description>I2C Slave Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/i2cs.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Communications" Cgroup="SPI Master" Cversion="1.1.0-a" condition="MAX32625 CMSIS SPI Master">
         <description>SPI Master Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/spim.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Communications" Cgroup="SPI Slave" Cversion="1.1.0-a" condition="MAX32625 CMSIS SPI Slave">
         <description>SPI Slave Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/spis.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Communications" Cgroup="SPI XIP" Cversion="1.1.0-a" condition="MAX32625 CMSIS SPI XIP">
         <description>SPI eXecute In Place (XIP) Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/spix.c" version="1.1.0-a"/>
         </files>
      </component>
<!--       <component Cclass="Trust Protection Unit" Cgroup="MAA" Cversion="1.1.0-a" condition="MAX32626 CMSIS MAA">
         <description>MAA Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/maa.c" version="1.1.0-a"/>
         </files>
      </component>
 -->
      <component Cclass="Communications" Cgroup="1-Wire Master" Cversion="1.1.0-a" condition="MAX32625 CMSIS 1-Wire">
         <description>1-Wire Master Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/owm.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="PMU" Cversion="1.1.0-a" condition="MAX32625 CMSIS PMU">
         <description>Peripheral Management Unit(PMU) for DMA</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/pmu.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="Pulse Train" Cversion="1.1.0-a" condition="MAX32625 CMSIS Pulse Train">
         <description>Pulse Train (PWM) Controller</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/pt.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="RTC" Cversion="1.1.0-a" condition="MAX32625 CMSIS RTC">
         <description>Real Time Clock Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/rtc.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="Flash IAP" Cversion="1.1.0-a" condition="MAX32625 CMSIS Flash IAP">
         <description>Flash In-Application Programming Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/flc.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="Timers" Cversion="1.1.0-a" condition="MAX32625 CMSIS TIMER">
         <description>32/16 Bit Timers</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/tmr.c" version="1.1.0-a"/>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/tmr_utils.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="WDT" Csub="WDT1" Cversion="1.1.0-a" condition="MAX32625 CMSIS WDT1">
         <description>Watchdog Timer 1</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/wdt.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="WDT" Csub="WDT2" Cversion="1.1.0-a" condition="MAX32625 CMSIS WDT2">
         <description>Watchdog Timer 2</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/wdt2.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Communications" Cgroup="UART" Cversion="1.1.0-a" condition="MAX32625 CMSIS UART">
         <description>UART Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32625PeriphDriver/Source/uart.c" version="1.1.0-a"/>
         </files>
      </component>

      <bundle Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cversion="1.1.0-a">
         <description>MAX32625 Evaluation Kit Board Support Package</description>
         <doc>https://datasheets.maximintegrated.com/en/ds/MAX32625-EVKIT.pdf</doc>
         <component Cgroup="Board Support" condition="MAX32625 BSP">
            <description>MAX32625 Evaluation Kit Board Setup</description>
            <RTE_Components_h>
               <!-- the following content goes into file 'RTE_Components.h' -->
               #define BOARD EvKit_V1
            </RTE_Components_h>
            <files>
               <file category="doc" name="https://datasheets.maximintegrated.com/en/ds/MAX32625-EVKIT.pdf"/>
               <file category="include" name="Boards/Maxim/MAX32625_EVKIT/Common/EvKit_V1/Include/"/>
               <file category="include" name="Boards/Maxim/MAX32625_EVKIT/Common/Include/"/>
               <file category="sourceC" name="Boards/Maxim/MAX32625_EVKIT/Common/EvKit_V1/Source/board.c" version="1.1.0-a"/>
               <file category="sourceC" name="Boards/Maxim/MAX32625_EVKIT/Common/Source/stdio.c" version="1.1.0-a"/>
               <file category="sourceC" name="Boards/Maxim/MAX32625_EVKIT/Common/Source/nhd12832.c" version="1.1.0-a"/>
               <file category="sourceC" name="Boards/Maxim/MAX32625_EVKIT/Common/Source/pb.c" version="1.1.0-a"/>
               <file category="sourceC" name="Boards/Maxim/MAX32625_EVKIT/Common/Source/led.c" version="1.1.0-a"/>
               <file category="sourceC" name="Boards/Maxim/MAX32625_EVKIT/Common/Source/max14690.c" version="1.1.0-a"/>
               <file category="sourceC" name="Boards/Maxim/MAX32625_EVKIT/Common/Source/mx25.c" version="1.1.0-a"/>
            </files>
         </component>
      </bundle>

      <bundle Cbundle="MAXUSB Libraries" Cclass="MAXUSB" Cversion="1.1.0-a">
         <description>MAXUSB Libraries for the Maxim Integrated ARM Cortex Family of Microcontrollers</description>
         <doc>https://datasheets.maximintegrated.com/en/ds/MAX32625-EVKIT.pdf</doc>
         <component Cgroup="MAXUSB" condition="Maxim USB">
            <description>Maxim Integrated USB libraries for the ARM Cortex.</description>
            <files>
               <file category="include" name="Libraries/MAXUSB/include/"/>
               <file category="include" name="Libraries/MAXUSB/include/core/"/>
               <file category="include" name="Libraries/MAXUSB/include/devclass/"/>
               <file category="include" name="Libraries/MAXUSB/include/enumerate/"/>
               <file category="include" name="Libraries/MAXUSB/include/core/arm/"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/core/arm/usb.c" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/core/usb_event.c" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/fifo.c" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/cdc_acm.c" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/hid_kbd.c" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/hid_raw.c" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/enumerate/enumerate.c" version="1.1.0-a"/>
            </files>
         </component>
      </bundle>

   </components>

</package>
